
'''17 задача 12
Даны три числа. Выведи то, которое встречается
 больше одного раза. Если таких чисел нет, выведи:
  все числа разные.'''

a = input()
b = input()
c = input()
if a in b or a in c:
    print(a)
elif b in a or b in c:
    print(a)
else:
    print("Все числа разные")
a = input()
b = input()
c = input()
if a in b or a in c:
    print(a)
elif b in a or b in c:
    print(a)
else:
    print("Все числа разные")